alacritty
alfred
android-platform-tools
authy
balenaetcher
discord
docker
emacs
firefox
google-chrome
google-cloud-sdk
insomnia
insomnia-designer
itsycal
keepingyouawake
kotlin-native
lastpass
lens
postman
responsively
robo-3t
sequel-pro
spectacle
spotify
steam
tableplus
the-unarchiver
visual-studio-code
