# Brewfile — packages to install on a new macOS machine.
# Apply with: brew bundle --file=~/sannonthachai/dotfiles/Brewfile
# (install.sh runs this automatically on macOS.)

# --- CLI formulae ---
brew "fastfetch"        # system info splash
brew "fzf"              # fuzzy finder (vim ,b /,/  +  zsh ctrl-r)
brew "htop"             # process viewer
brew "ripgrep"          # rg — used by vim ,/  and rg helpers
brew "tmux"             # terminal multiplexer
brew "vim"              # Homebrew vim (Apple's /usr/bin/vim has broken clipboard)
brew "node"             # required by coc.nvim, instant-markdown-d, claude-code CLI
brew "pass"             # password-store (gpg-backed CLI password manager)

# --- DevOps / containers ---
brew "colima"           # Docker runtime on macOS (Linux VM)
brew "docker"           # docker CLI
brew "docker-compose"   # compose v2 CLI plugin
brew "kubernetes-cli"   # kubectl
brew "helm"             # Helm 3
brew "k9s"              # K8s TUI

# --- GUI apps (casks) ---
cask "google-chrome"
cask "wezterm"          # primary terminal emulator
cask "visual-studio-code"
cask "obsidian"
cask "discord"
cask "microsoft-teams"
cask "openvpn-connect"  # corp VPN client
